Revit 2024 API
StructuralSectionCParallelFlange.BoltDiameter Property
 Maximum bolt hole diameter, in. (mm)
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public double BoltDiameter { get; set; }
Visual Basic
Public Property BoltDiameter As Double
	Get
	Set
Visual C++
public:
property double BoltDiameter {
	double get ();
	void set (double value);
}
See Also
StructuralSectionCParallelFlange Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace